000100 IDENTIFICATION DIVISION.                                         00010041
000200 PROGRAM-ID.    CBLDB21.                                          00020041
000300 AUTHOR.        CSU0127 ADAM DAVIES.                              00030041
000400*INSTALLATION.  CSU.                                              00040041
000500*SECURITY.      UNCLASSIFIED.                                     00050041
000600*DATE-WRITTEN.  FEB 23, 2020.                                     00060041
000700*DATE-COMPILED.                                                   00070041
000710*****************************************************             00071042
000720*   PROGRAM IS HOW TO ADD TO THE SAME LINE FOR PRINT*             00072042
000730*****************************************************             00073042
000800                                                                  00080041
000900 ENVIRONMENT DIVISION.                                            00090041
001000*                                                                 00100041
001100 CONFIGURATION SECTION.                                           00110041
001200 SOURCE-COMPUTER.                                                 00120041
001300     Z13                                                          00130041
001400     WITH DEBUGGING MODE                                          00140041
001500     .                                                            00150041
001600                                                                  00160041
001700 OBJECT-COMPUTER.  IBM-Z13.                                       00170041
001800                                                                  00180041
001900 INPUT-OUTPUT SECTION.                                            00190041
002000 DATA DIVISION.                                                   00200041
002100 WORKING-STORAGE SECTION.                                         00210041
002200                                                                  00220041
002300*****************************************************             00230041
002400*   DATA VARS FOR PRINTING OUT AN MESSAGE           *             00240041
002500*****************************************************             00250041
002600                                                                  00260041
002700 01  WS-PRINT-REC.                                                00270041
002800     05  TEXT-HERE             PIC X(040).                        00280041
002810     05  TEXT2-HERE            PIC X(040).                        00281041
002820     05  TEXT3-HERE            PIC X(040).                        00282041
002900                                                                  00290041
003000 PROCEDURE DIVISION.                                              00300041
003100                                                                  00310041
003200*****************************************************             00320041
003300*   MAIN PROGRAM ROUTINE                            *             00330041
003400*****************************************************             00340041
003500 010-PROG-START.                                                  00350041
003600     PERFORM 300-PRINT-A-LINE                                     00360041
003700     .                                                            00370041
003800                                                                  00380041
003801*****************************************************             00380141
003802*   THIS IS TO MOVE DIFRENT VARS TO SAME OUTPUTLINE *             00380241
003803*****************************************************             00380341
003900 300-PRINT-A-LINE.                                                00390041
004000     MOVE "HELLO WORLD" TO  TEXT-HERE                             00400041
004010     MOVE "MY NAME IS ALPACA" TO  TEXT2-HERE                      00401041
004020     MOVE "I MADE THIS 2-23-2020" TO  TEXT3-HERE                  00402041
004100     PERFORM 700-PRINT-LINE                                       00410041
004200     .                                                            00420041
004300                                                                  00430041
004400 700-PRINT-LINE.                                                  00440041
004500     PERFORM 750-WRITE                                            00450041
004600     .                                                            00460041
004700                                                                  00470041
004800 750-WRITE.                                                       00480041
004900     DISPLAY WS-PRINT-REC                                         00490041
005000     .                                                            00500041
005100                                                                  00510041
