000100 IDENTIFICATION DIVISION.                                         00010001
000200 PROGRAM-ID.    HELLOW.                                           00020045
000300 AUTHOR.        CSU0127 ADAM DAVIES.                              00030037
000400*INSTALLATION.  CSU.                                              00040004
000500*SECURITY.      UNCLASSIFIED.                                     00050002
000600*DATE-WRITTEN.  FEB 23, 2020.                                     00060041
000700*DATE-COMPILED.                                                   00070002
000710*****************************************************             00071045
000720*   PROGARM IS TO MAKE HELLO WORLD                  *             00072045
000730*****************************************************             00073045
000800                                                                  00080002
000900 ENVIRONMENT DIVISION.                                            00090002
001000*                                                                 00100002
001100 CONFIGURATION SECTION.                                           00110006
001200 SOURCE-COMPUTER.                                                 00120015
001300     Z13                                                          00130015
001400     WITH DEBUGGING MODE                                          00140015
001500     .                                                            00150015
001600                                                                  00160015
001700 OBJECT-COMPUTER.  IBM-Z13.                                       00170006
002100                                                                  00210007
002200 INPUT-OUTPUT SECTION.                                            00220002
002600 DATA DIVISION.                                                   00260002
003600 WORKING-STORAGE SECTION.                                         00360002
003700                                                                  00370024
004500*****************************************************             00450002
004600*   DATA VARS FOR PRINTING OUT AN MESSAGE           *             00460041
004700*****************************************************             00470002
005000                                                                  00500002
005100 01  WS-PRINT-REC.                                                00510025
005200     05  TEXT-HERE             PIC X(120).                        00520037
005300                                                                  00530002
008500 PROCEDURE DIVISION.                                              00850002
008600                                                                  00860002
008700*****************************************************             00870002
008800*   MAIN PROGRAM ROUTINE                            *             00880002
008900*****************************************************             00890002
009000 010-PROG-START.                                                  00900023
009400     PERFORM 300-PRINT-A-LINE                                     00940037
009500     .                                                            00950024
010100                                                                  01010024
010500 300-PRINT-A-LINE.                                                01050023
010600     MOVE "HELLO WORLD" TO  TEXT-HERE                             01060037
010700     PERFORM 700-PRINT-LINE                                       01070024
010800     .                                                            01080002
010900                                                                  01090024
011000 700-PRINT-LINE.                                                  01100024
011100     PERFORM 750-WRITE                                            01110024
011500     .                                                            01150024
011600                                                                  01160024
011700 750-WRITE.                                                       01170024
012100     DISPLAY WS-PRINT-REC                                         01210039
012500     .                                                            01250024
012600                                                                  01260024
